app/views/posts/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
          <span>By: <%= post.user ? post.user.username : "Anonymous" %></span>
          <span><%= link_to "Comments (#{post.comments.count})", post_path(post) %></span>