app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["content", "It will be someone "], ["user_id", 1], ["post_id", 1], ["created_at", "2024-11-01 20:32:22.315882"], ["updated_at", "2024-11-01 20:32:22.315882"]]
---
  def create
    @comment = if current_user
                @post.comments.build(comment_params.merge(user: current_user))
              else
                guest_user = ensure_guest_user
                if guest_user
                  @post.comments.build(comment_params.merge(user: guest_user))
                else
                  render json: { error: "Failed to create guest user" }, status: :internal_server_error
                  return
                end
              end

    if @comment.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_post
    @post = Post.find_by(id: params[:post_id])