app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY "posts"."created_at" DESC  [["user_id", 1]]
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["content", "No one still knows who will be the next president!"], ["user_id", 1], ["created_at", "2024-11-01 20:25:55.415616"], ["updated_at", "2024-11-01 20:25:55.415616"]]
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "ziqi"], ["LIMIT", 1]]
---
  def index
    # cache key for low level cache
    cache_key = "posts/all-#{Post.maximum(:updated_at)}-#{Post.count}"

    posts_data = Rails.cache.fetch(cache_key, expires_in: 5.minutes) do
      Rails.logger.info "Generating fresh data..."
      Post.includes(:user, :comments).order(created_at: :desc).map { |post|
        {
          id: post.id,
          content: post.content,
          created_at: post.created_at,
          user: {
            id: post.user&.id,
            username: post.user&.username
          },
          likes: post.likes.map(&:to_s),
          comments: post.comments.map { |comment|

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]
---
  def show
    @post = Post.all.find(params[:id])
    render json: {
      id: @post.id,
      content: @post.content,
      created_at: @post.created_at,
      user: {
        id: @post.user&.id,
        username: @post.user&.username
      },
      likes: @post.likes.map(&:to_s),
      comments: @post.comments.map { |comment|

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["content", "No one still knows who will be the next president!"], ["user_id", 1], ["created_at", "2024-11-01 20:25:55.415616"], ["updated_at", "2024-11-01 20:25:55.415616"]]
---
  def create
    @post = if current_user
              current_user.posts.build(post_params)
            else
              # Get or create guest user
              guest_user = ensure_guest_user
              if guest_user
                guest_user.posts.build(post_params)
              else
                render json: { error: "Failed to create guest user" }, status: :internal_server_error
                return
              end
            end

    @post.likes = []

    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_post
    @post = Post.find_by(id: params[:id])