app/controllers/sessions_controller.rb

  def create
    user = User.find_or_create_by(username: params[:username])
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["username", "Parsa"], ["created_at", "2024-11-01 20:17:41.543785"], ["updated_at", "2024-11-01 20:17:41.543785"]]
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Parsa"], ["LIMIT", 1]]